[
  {
    "author": "TnEShlaes",
    "content": "Seriously?",
    "rating": 1,
    "date": "2012-01-06T00:00:00.000Z",
    "certified": false,
    "published": false
  },
  {
    "author": "47dingos",
    "content": "We picked up a coupon book from a rest stop and discovered that all the motels we tried had reason not take them, including this one. So we paid a whopping $80.00 u.s. to stay in this god forsaken place.",
    "rating": 1,
    "date": "2005-03-23T00:00:00.000Z",
    "certified": false,
    "published": true
  },
  {
    "author": "Bandaid308",
    "content": "Booked online. Room was 2 Queens in a suite.Cozy. Service from check-in to check-out was friendly, courteous, efficient. Second morning, addressed us by name, enquired how we were doing. Hotel is in a great location for good food, shopping, and entertainment! Will book again! Thanks",
    "rating": 4,
    "date": "2010-11-10T00:00:00.000Z",
    "certified": false,
    "published": true
  },
  {
    "author": "kayakbc",
    "content": "This hotel was perfect for a girls shopping trip in Seattle. The price was great, especially for the location - the rooms are small, however if you don't plan on spending much time in them, it shouldn't be a problem.",
    "rating": 4,
    "date": "2011-02-18T00:00:00.000Z",
    "certified": false,
    "published": true
  },
  {
    "author": "SpicyIrony",
    "content": "Firstly, I want to express that this hotel was horrible. Our room was match box tiny, you couldn't even breathe, though that was expected because we only paid $120 per night for the room. We were charged an extra $50 dollar parking fee for two nights. It was actually supposed to be $40 but they seemed to tack on an extra $10 for a \"deposit\" (Phone and Television were not included, but were probably an extra $50)",
    "rating": 1,
    "date": "2007-08-25T00:00:00.000Z",
    "certified": false,
    "published": true
  },
  {
    "author": "Mike G",
    "content": "A beutiful heritage building with 2011 upgrades. Great Location Super Service Will stay again",
    "rating": 5,
    "date": "2011-08-22T00:00:00.000Z",
    "certified": true,
    "published": true
  },
  {
    "author": "johncrawcarp",
    "content": "The details of the rooms detailed on their website are falsely listed. They do not offer continental breakfast, they do not have a fridge in the room. Booking travel comes with expectations based on the outline of hotel and room rate details.",
    "rating": 2,
    "date": "2011-12-29T00:00:00.000Z",
    "certified": true,
    "published": true
  },
  {
    "author": "jamieg23",
    "content": "I stayed here with a friend for a wedding, and we both returned home (LA and Boston) with bed bugs!! The location is great, but apparently they're in need of an exterminator.",
    "rating": 1,
    "date": "2010-09-08T00:00:00.000Z",
    "certified": false,
    "published": true
  },
  {
    "author": "darban",
    "content": "I'm the owner so 5 stars lol",
    "rating": 5,
    "date": "2011-10-14T00:00:00.000Z",
    "certified": true,
    "published": false
  },
  {
    "author": "slamdance",
    "content": "I sent my two sons (age 24 and 17) to Seattle on vacation and called ahead to set up the room for them. Jennifer was very helpful and made sure that my sons were set up in the perfect room for them, and at a great rate! Thank you very much!",
    "rating": 5,
    "date": "2011-01-29T00:00:00.000Z",
    "certified": true,
    "published": true
  },
  {
    "author": "steveca01",
    "content": "This hotel is in a very very good location in Seattle. However, the weather was quite warm in Seattle (unusual for September they say) and the A/C had been turned off !",
    "rating": 3,
    "date": "2010-09-28T00:00:00.000Z",
    "certified": true,
    "published": true
  },
  {
    "author": "EBella",
    "content": "My bf and I stayed for two nights in July 2011. We booked online and got a decent rate for a Deluxe King with wine reception. We were able to drop off our bags at 10am and park the car in the parkade.",
    "rating": 4,
    "date": "2011-08-11T00:00:00.000Z",
    "certified": false,
    "published": true
  },
  {
    "author": "A TripAdvisor Member",
    "content": "We were doing multi-city traveling so decided to make sleeping arrangements lowest priority. This definitely was low.",
    "rating": 2,
    "date": "2005-03-24T00:00:00.000Z",
    "certified": true,
    "published": true
  },
  {
    "author": "xcapee",
    "content": "Had an enjoyable 2 night stay here in a central location in downtown Seattle. The hotel is 5 minute to central shopping area and 10 minutes to Pike Place markets.",
    "rating": 4,
    "date": "2011-05-11T00:00:00.000Z",
    "certified": false,
    "published": true
  },
  {
    "author": "panfry",
    "content": "I have stayed in far better places in Seattle for less. Room was the size of a prison cell, with a window facing a outside wall.",
    "rating": 3,
    "date": "2008-05-03T00:00:00.000Z",
    "certified": true,
    "published": true
  },
  {
    "author": "luvs2goplaces",
    "content": "I stayed here with my daughter and two sons, my daughter had to attend a conference in Seattle and it was all booked very last minute.",
    "rating": 4,
    "date": "2009-06-26T00:00:00.000Z",
    "certified": false,
    "published": true
  },
  {
    "author": "AKS2010",
    "content": "I had read several reviews before booking this hotel, and most of the positive ones were very true! Before staying here, you have to know that this hotel is older.",
    "rating": 4,
    "date": "2011-08-04T00:00:00.000Z",
    "certified": true,
    "published": true
  },
  {
    "author": "ejgray30",
    "content": "Very helpful staff, free use of internet. The room was pretty small, but the great location made up for this. Very convenient for our one-night stay, and places to eat breakfast nearby.",
    "rating": 4,
    "date": "2010-08-23T00:00:00.000Z",
    "certified": false,
    "published": true
  }
]
