[
  {
    "author": "yep-popper",
    "content": "We get to enjoy Pacific Plaza Hotel, Seattle, Washginton at least once a year when we go to Seattle in March. (which is not enough). It is a wonderful place to stay. They are very accommodating and courteous. The location of the hotel is wonderful. Great place, great prices, great people!! Once you go, you won't go any place else. Enjoy your stay!!",
    "rating": 5,
    "date": "2005-03-24T00:00:00.000Z",
    "certified": false,
    "published": true
  },
  {
    "author": "Ryan H",
    "content": "I was looking for a better than average Hotel downtown for my wife and I to enjoy a valentine weekend and I thought the price offered was the best deal. We only stayed one night in #423. Well, you get what you pay for.",
    "rating": 2,
    "date": "2012-02-12T00:00:00.000Z",
    "certified": false,
    "published": true
  },
  {
    "author": "Cork-Popper",
    "content": "My husband & I stayed at this hotel 2 days before Christmas in a Superior Queen Room. The room's size was perfect -- chair by the window, large armoir w/TV that had 3 drawers for your stuff, queen bed and nightstand on each side.",
    "rating": 4,
    "date": "2007-01-06T00:00:00.000Z",
    "certified": true,
    "published": true
  },
  {
    "author": "weemacs",
    "content": "We booked this hotel and were confused when we arrived as it did not seem to be as the website indicated. The name is so similar to the Pacific Plaza and Tripadvisor do not differentiate as the confusing travellers reports indicate.",
    "rating": 1,
    "date": "2006-07-05T00:00:00.000Z",
    "certified": false,
    "published": true
  },
  {
    "author": "Traveler3305",
    "content": "Nice hotel in downtown Seattle. Close to most major attractions. The rooms are a little outdated but are well maintained. The lobby area is clean and modern with access to a cafe. I did hear several complaints about parking (too far/complex parking area). Otherwise, its a nice hotel.",
    "rating": 4,
    "date": "2011-08-19T00:00:00.000Z",
    "certified": true,
    "published": true
  },
  {
    "author": "Ean B",
    "content": "Both the General manager and Desk Manager are completely unaccommodating, to try and build a relationship in the hospitality industry these two individuals are completely ill-equipped, especially to a long term customer.",
    "rating": 1,
    "date": "2012-01-18T00:00:00.000Z",
    "certified": false,
    "published": true
  },
  {
    "author": "CCBinx",
    "content": "My husband and I just stayed at the hotel in mid-July and had a horrible experience there. Not only was our Superior Queen room incredibly cramped, but the noises from the elevator and other guests' rooms made it nearly impossible to sleep through the night.",
    "rating": 1,
    "date": "2007-07-29T00:00:00.000Z",
    "certified": false,
    "published": true
  },
  {
    "author": "sinks",
    "content": "The Kings Inn is an old motel in downtown Seattle within a few blocks of Pikes Place Market. Although old, the location was great, the rooms were clean (including the bathroom) and the parking lot was secured at night.",
    "rating": 3,
    "date": "2010-10-14T00:00:00.000Z",
    "certified": false,
    "published": true
  },
  {
    "author": "cejay",
    "content": "After looking at the reviews we were skeptical, but as this hotel suited our purposes we decided to give it a try. We were not disappointed; staff were very helpful. For the price what more can you expect. Overall not a bad experience.",
    "rating": 3,
    "date": "2008-07-25T00:00:00.000Z",
    "certified": false,
    "published": true
  },
  {
    "author": "twistedhouse",
    "content": "Seriously? Try another skill rather than opening a garbage hotel",
    "rating": 2,
    "date": "2004-12-21T00:00:00.000Z",
    "certified": false,
    "published": false
  },
  {
    "author": "spiaggia",
    "content": "It's been 6 months since we stayed in this hotel over the Xmas season but I just wanted to say how much we enjoyed our stay here. Yes, late but still, I'm sure things don't change that much. We were apprehensive about the hotel before arrival from reading about it and the fact that it is a very old hotel in the downtown area. -Mae",
    "rating": 4,
    "date": "2005-06-21T00:00:00.000Z",
    "certified": false,
    "published": true
  },
  {
    "author": "radcmr",
    "content": "My Fiance and I arrived in Seattle for along weekend. We were able to take the light rail from the airport which stopped only 2 short blocks from the hotel.",
    "rating": 4,
    "date": "2010-11-11T00:00:00.000Z",
    "certified": false,
    "published": true
  },
  {
    "author": "KitKatChunk",
    "content": "We stayed here from Aug. 13 to 16, 2008 and was given the third room from the elevators on the 7th floor. On the whole, the stay was OK and I would come back again. That said, there are things which irked me and could/needs to be improved for sure.",
    "rating": 2,
    "date": "2008-08-17T00:00:00.000Z",
    "certified": true,
    "published": true
  },
  {
    "author": "ralltir",
    "content": "Absolute shit, wouldn't even recommend to my worst enemy",
    "rating": 1,
    "date": "2011-05-29T00:00:00.000Z",
    "certified": false,
    "published": false
  },
  {
    "author": "Hilarina",
    "content": "We were unsure if we should book here because it only had 3 stars on here, but I am so glad that we did.",
    "rating": 5,
    "date": "2010-05-30T00:00:00.000Z",
    "certified": true,
    "published": true
  },
  {
    "author": "LucyPie",
    "content": "Really really really small room but old buildings like this are often small. They have two computers for guest use and Wi-Fi in a nice sitting room/business area. Parking costs about $8 per day in covered garage next door. Good location for shopping and waterfront. Loved Elliotts Waterfront restaurant and The Brooklyn Restaurant. Loved Nordstroms! Had a great time in Seattle.",
    "rating": 3,
    "date": "2006-08-22T00:00:00.000Z",
    "certified": false,
    "published": true
  },
  {
    "author": "Bio-traveler",
    "content": "I would not recommend this hotel to anyone who wants to have a clean experience in the bathroom or who wants to sleep at night without noise.",
    "rating": 1,
    "date": "2010-01-28T00:00:00.000Z",
    "certified": false,
    "published": true
  }
]
