[
  {
    "author": "shelneu1",
    "content": "We stayed at this hotel based on the price and proximity to Safeco Field. The hotel had multiple issues that I wouldn't have expected for something that is advertised as \"luxury and boutique\".",
    "rating": 3,
    "date": "2010-06-27T00:00:00.000Z",
    "certified": false,
    "published": true
  },
  {
    "author": "cindyseattle",
    "content": "This hotel is in a older building across the street from the Seattle Public Library. There is a Seattle's Best Coffee shop inside the hotel which is great. The staff are pleasant and very helpful. Unfortunately that isn't the issue.",
    "rating": 3,
    "date": "2012-01-30T00:00:00.000Z",
    "certified": false,
    "published": true
  },
  {
    "author": "Lamontetim16",
    "content": "The Kings Inn is a great place but the building is a little older. Secure at night, gates are closed and 24 hour doorman.",
    "rating": 5,
    "date": "2011-01-27T00:00:00.000Z",
    "certified": false,
    "published": true
  },
  {
    "author": "Allison555",
    "content": "This is a nice hotel with good size rooms and very close to the action. It is within walking distance to Safco Field, Pike Place, Capital Hill, Lake Union, Space Needle and the water front.",
    "rating": 5,
    "date": "2011-08-19T00:00:00.000Z",
    "certified": false,
    "published": true
  },
  {
    "author": "meems0465",
    "content": "Staff here were all friendly and we enjoyed our stay. We were here for the U2 Concert. Excellent central location. Rooms are small but nice and clean. Worked out for us!",
    "rating": 4,
    "date": "2011-06-07T00:00:00.000Z",
    "certified": false,
    "published": true
  },
  {
    "author": "rrogers001",
    "content": "Only a short walk to the Pike Market and The Waterfront. Rooms were nice and very tastefully decorated. Good coffee shop in the hotel lobby area. Great location! Enjoy! Visitor from North Carolina",
    "rating": 4,
    "date": "2011-06-19T00:00:00.000Z",
    "certified": false,
    "published": true
  },
  {
    "author": "OliviaKG",
    "content": "I am a college student, used to living in dorm rooms. I have never heard such intimate details of what people staying next to me were up to as I have at the Executive Hotel Pacific.",
    "rating": 1,
    "date": "2011-10-07T00:00:00.000Z",
    "certified": true,
    "published": true
  },
  {
    "author": "Lael_Lael",
    "content": "My boyfriend and I wandered in here late one night and managed to book a corner room on the 3rd floor for $60. The King's Inn is one of the only downtown hotels where I haven't been required to put a credit card on file.",
    "rating": 1,
    "date": "2011-07-19T00:00:00.000Z",
    "certified": false,
    "published": true
  },
  {
    "author": "KPSINC",
    "content": "2 of our staff members were scheduled to stay at this hotel July 19th for a business meeting in downtown Seattle. A credit card authorization form was required. It was completed and included copies of the front and back of the corporate credit card.",
    "rating": 1,
    "date": "2011-07-18T00:00:00.000Z",
    "certified": false,
    "published": false
  },
  {
    "author": "STFPortland",
    "content": "You can't beat the price given the great downtown location - but this place is definitely more \"motel 6' than 'executive'",
    "rating": 3,
    "date": "2010-11-16T00:00:00.000Z",
    "certified": false,
    "published": true
  },
  {
    "author": "GAB059",
    "content": "We stayed at the EHP during the coldest days in Seattle and had a great time. The staff was very friendly and helped us with bus routes, and light rail, and places to eat nearby.",
    "rating": 4,
    "date": "2011-02-27T00:00:00.000Z",
    "certified": false,
    "published": true
  },
  {
    "author": "tomriggs",
    "content": "great location to downtown Seattle,shopping,good restaurants.",
    "rating": 3,
    "date": "2011-01-09T00:00:00.000Z",
    "certified": false,
    "published": true
  },
  {
    "author": "mzungu f",
    "content": "this is a value priced hotel, and there are some inconveniences. however, some are to be expected when staying downtown in an older hotel in a large city. parking is around the corner, and will only allow for a normal height SUV at most.",
    "rating": 3,
    "date": "2012-02-27T00:00:00.000Z",
    "certified": false,
    "published": true
  },
  {
    "author": "coop1ny",
    "content": "The Executive Hotel Pacific was a gem and is located within blocks of all the sights of Seattle’s city center. Built in 1928, the Pacific Executive Hotel has been restored to a wonderful level of comfort and has a Seattle's Best Coffee bar on its ground floor level.",
    "rating": 5,
    "date": "2011-08-09T00:00:00.000Z",
    "certified": false,
    "published": true
  },
  {
    "author": "NN1276",
    "content": "Take your money elsewhere! The hotel rooms are outdated and dirty! When we checked in we were ignored by the front desk attendants for more than 10 minutes while they talked among themselves.",
    "rating": 1,
    "date": "2011-08-03T00:00:00.000Z",
    "certified": false,
    "published": false
  },
  {
    "author": "Joan G",
    "content": "I am an international traveller, with access to all types, sizes and brands of hotels worldwide. I love this hotel. The location is excellent, the staff friendly, cleanliness is exceptional and again, the location, location, location is the best !",
    "rating": 5,
    "date": "2011-10-10T00:00:00.000Z",
    "certified": false,
    "published": true
  },
  {
    "author": "Minato2010",
    "content": "I was in a rush to find a reasonably priced room in downtown Seattle, of course, at the last minute. I found this one and booked it four nights without researching it. Out of curiosity, I looked at the reviews. I got into a panic!",
    "rating": 3,
    "date": "2010-08-28T00:00:00.000Z",
    "certified": false,
    "published": true
  },
  {
    "author": "mate44",
    "content": "yes, this place is basic, with aged furniture and bathroom... but my experience was by far not as bad as described in many other reviews. The room was cleant every day, TV worked, the bed was okay and I didn't have to share it with any bugs. Well, the doors indeed do not appear as secure but it's not good practice in any hotel to leave your valuables outside of a safe.",
    "rating": 3,
    "date": "2010-11-23T00:00:00.000Z",
    "certified": false,
    "published": true
  },
  {
    "author": "Jase13",
    "content": "I wanted a hotel that was reasonable in price, located in downtown, clean, and offered self parking at a reasonable rate rather than valet parking which I refuse to use primarely because I don't want some stranger driving my vehicle and I'm not lazy enough to require someone else to park my car for me.",
    "rating": 4,
    "date": "2010-11-07T00:00:00.000Z",
    "certified": true,
    "published": true
  },
  {
    "author": "mspenn",
    "content": "My husband and I go to Baltimore often as he has family and friends from college in the area. The location was right where we wanted.",
    "rating": 4,
    "date": "2011-07-29T00:00:00.000Z",
    "certified": false,
    "published": true
  }
]
